#'[----------------------------------------------------------]
#'[--------------R анхан шат гэрийн даалгавар----------------]


#'*----------------------------------------------------------*
#'*----------------------------------------------------------*
#'[--------------Бүлэг 2 гэрийн даалгавар----------------]

#'[Даалгавар хийх жишээ: ]

#'[ 3-н тоог 4-өөр үржүүлнэ үү.]

3 * 4
# [1] 12



#'[ Даалгавар 1 ]

#'[ 6 + 12          ямар үр дүн гарах вэ?.]



#'[ 5 - 5           ямар үр дүн гарах вэ?.]



#'[ 2 ^ 5           ямар үр дүн гарах вэ?.]



#'[ (5 + 5) / 2     ямар үр дүн гарах вэ?.]






#'[ Даалгавар 2 ]


#'[ 58 гэсэн тоог  banana  гэсэн хувьсагчид /Variable/ оруулна уу.]



#'[ banana гэсэн хувьсагч /Variable/ дотор байгаа тоог хэвлэж /print/ гаргана уу.]



#'[ 5 гэсэн тоог alim гэсэн хувьсагчид /Variable/ оруулна уу.]



#'[ alim гэсэн хувьсагч /Variable/ дотор байгаа тоог хэвлэж /print/ гаргана уу.]



#'[ Шинээр niit_jims гэсэн хувьсагч дотор banana + alim гэсэн өмнө нь зохиосон хувьсагчийг оруулна уу.]



#'[ niit_jims гэсэн хувьсагч /Variable/ дотор байгаа тоог хэвлэж /print/ гаргана уу.]









#'[ Даалгавар 3 ]

#'[ Шинээр  niit_orlogo гэсэн хувьсагч дотор дараах тоон векторуудыг оруулна уу. ]

c(12000, 56000, 65000, 69550, 32400)


#'[ niit_orlogo гэсэн хувьсагч дотор байгаа тоон векторуудын хэвийн тархалтыг/The Normal Distribution/ олно уу. rnorm() функцийг ашиглана уу.]




#'[ Шинээр ed_baraanuud гэсэн хувьсагч дотор дараах үгэн векторуудыг оруулна уу. ]

c("omd", "tsamts", "laptop", "dugui", "laptop", "dugui",
          "omd", "dugui", "smartphone", "omd", "smartphone",  "tsamts","smartphone", "omd")



#'[ Шинээр  ed_baraanuudiin_angilal гэсэн хувьсагч дотор байгаа үгэн векторуудыг Фактор/factor функцийн тусламжтайгаар ангилна уу. Ашиглах функцийн нэр нь: factor()]




#'[ ed_baraanuudiin_angilal гэсэн хувьсагч /Variable/ дотор байгаа ангилалыг хэвлэж /print/ гаргана уу.]










