#'*----------------------------------------------------------*
#'*----------------------------------------------------------*
#'*----------------------------------------------------------*
#'[--------------Бүлэг 3 гэрийн даалгавар----------------]


#'[ Даалгавар 1 ]


#'[Матриц:  Шинээр  niit_orlogo гэсэн хувьсагч дотор дараах тоон векторуудыг оруулна уу. ]

c(650000, 560000, 1000000, 5000000, 4000000)


#'[Матриц:  Шинээр  niit_zarlaga гэсэн хувьсагч дотор дараах тоон векторуудыг оруулна уу. ]

c(120000, 500000, 85000, 250000, 700000)


#'[Матриц: Шинээр shine_matrix гэсэн хувьсагч дотор cbind() функцийг ашиглаж дээрх хувьсагчуудыг баганаар нь холбож матриц зохионо уу.]



#'[Матриц: Шинээр зохиосон shine_matrix гэсэн хувьсагчийг print() комманд ашиглаж хэвлэж гаргана уу.]
print(shine_matrix)







